app/Http/Controllers/PostController.php

    public function index()
    {
        $user_id = auth()->user()->id;
        $posts = Post::where('user_id', $user_id)->get();
---
select * from `posts` where `user_id` = 1