app/Http/Controllers/PublicController.php

    public function index()
    {
        $posts = Post::with('user')->latest()->get();
---
select * from `posts` order by `created_at` desc
select * from `users` where `users`.`id` in (1)